HIKARIZG1102/stm32-toolkit/templates/F103C8-hal/src/main.c
/* main.c — STM32 HAL 项目模板 */
#include "stm32f1xx_hal.h"

/* RAM 向量表（HAL_Init + SysTick 中断时需 512 字节对齐） */
static uint32_t ram_vector[256] __attribute__((aligned(512)));

void SysTick_Handler(void) { HAL_IncTick(); }

static void ram_vector_init(void) {
    uint32_t *flash_vtor = (uint32_t *)0x08000000;
    for (int i = 0; i < 256; i++)
        ram_vector[i] = flash_vtor[i];
    ram_vector[15] = (uint32_t)SysTick_Handler | 1;
    SCB->VTOR = (uint32_t)ram_vector;
}

int main(void) {
    ram_vector_init();

    RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
    GPIOB->CRH = (GPIOB->CRH & ~0xFFF00000) | 0x08300000;
    GPIOB->ODR |= (1 << 14);

    SystemCoreClock = 8000000;
    HAL_Init();

    for (int i = 0; i < 5; i++) {
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_13, GPIO_PIN_RESET);
        HAL_Delay(300);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_13, GPIO_PIN_SET);
        HAL_Delay(300);
    }

    uint8_t last = 1;
    while (1) {
        uint8_t key = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_14);
        if (key == 0 && last == 1)
            HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_13);
        last = key;
        HAL_Delay(20);
    }
}
